Add support for vendor tags
- [x] add tags to schema without breaking anything
- [x] make tags addable and editable
- [x] add tagify function (util to append tags)
- [x] add add-tag command and function
- [x] TDD remove-tag util
- [ ] rename tagify to tag
- [ ] rename remove-tag to untag
- [ ] add remove-tag command and function
